Revit 2026 API

# BuiltInFailuresFabricSheetFailures Class

---

Failures related to fabric sheet elements.

SystemObject Autodesk.Revit.DBBuiltInFailuresFabricSheetFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FabricSheetFailures
```
```vb
Public NotInheritable Class FabricSheetFailures
```
```cpp
public ref class FabricSheetFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FabricSheetFailures = class end
```

The BuiltInFailuresFabricSheetFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BentFabricSheetTooLongBendingProfile | The bent edge is shorter than the bend profile for this fabric sheet type. |
|  | FabricSheetOutSideOfHostError | Fabric Sheet is placed completely outside of its host. |
|  | FabricSheetOutSideOfHostWarning | Fabric Sheet is placed completely outside of its host. |

#### Reference

Autodesk.Revit.DB Namespace